# GetActiveServerId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SingleServerService..::..GetActiveServerId Method
SingleServerService Class See Also
---
Returns the Id of the currently active application-level server of the service.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public Guid GetActiveServerId()
```

Visual Basic
---
```text
Public Function GetActiveServerId As Guid
```

Visual C++
---
```text
public:
Guid GetActiveServerId()
```

# ### Return Value
The GUID of the active server, or an invalid GUID if there is no active server assigned.
# See Also
SingleServerService Class
GetActiveServerId Overload
Autodesk.Revit.DB.ExternalService Namespace